In [22]:
import pandas as pd

In [23]:
df = pd.read_csv("GlobalLandTemperaturesByCountry.csv")

In [24]:
df['year'] = pd.DatetimeIndex(df['dt']).year

In [25]:
#Taking the years from 1913 to 2013 --> 200 years 
#Skipping from 1750 to 1913 to avoid nan values

In [26]:
df_f = df[df['year']>1913]

In [27]:
df_f.isna().sum()

dt                                 0
AverageTemperature               999
AverageTemperatureUncertainty    260
Country                            0
year                               0
dtype: int64

In [31]:
df_interpolate = df_f.interpolate()

In [33]:
df_interpolate.isna().sum()

dt                               0
AverageTemperature               0
AverageTemperatureUncertainty    0
Country                          0
year                             0
dtype: int64

In [34]:
df_interpolate

,dt,AverageTemperature,AverageTemperatureUncertainty,Country,year
2042,1914-01-01,-2.755,0.404,Åland,1914
2043,1914-02-01,1.093,0.931,Åland,1914
2044,1914-03-01,-1.070,0.234,Åland,1914
2045,1914-04-01,4.034,0.725,Åland,1914
2046,1914-05-01,6.940,0.393,Åland,1914
...,...,...,...,...,...
577457,2013-05-01,19.059,1.022,Zimbabwe,2013
577458,2013-06-01,17.613,0.473,Zimbabwe,2013
577459,2013-07-01,17.000,0.453,Zimbabwe,2013
577460,2013-08-01,19.759,0.717,Zimbabwe,2013
577461,2013-09-01,19.759,0.717,Zimbabwe,2013

In [37]:
df_short = df_interpolate[["Country","AverageTemperature"]]

In [39]:
df_short = df_short.groupby("Country").mean()

In [40]:
df_short

                AverageTemperature
Country
Afghanistan              14.310228
Africa                   24.305714
Albania                  12.954596
Algeria                  23.352423
American Samoa           26.784978
...                            ...
Western Sahara           22.654384
Yemen                    26.393935
Zambia                   21.461909
Zimbabwe                 21.310056
Åland                     5.722512

[243 rows x 1 columns]

In [41]:
df_short.to_csv("Temperatures.csv")

In [44]:
df_short["AverageTemperature"].max()

28.941401002506268

In [45]:
df_short["AverageTemperature"].min()

-18.046211361737676